<img src="https://raw.githubusercontent.com/afo/data-x-plaksha/master/imgsource/dx_logo.png" align="left"></img><br><br><br><br>

## Plaksha SQL assignment

---

## Submission details:

Please submit this as a Jupyter Notebook and a PDF of your results (both should show output). Also push your solutions to Github.

For the submision create a local database with `sqlite3` or `sqlalchemy` in a Jupyter notebook and make the queries either with a cursor object (and then print the results) or by using pandas `pd.read_sql_query()`.

___

When completing this homework you can experiment with SQL commands by utilizing this great online editor:

https://www.w3schools.com/sql/trysql.asp?filename=trysql_select_all

There are already some tables in the online Database, namely:

`Categories, Employees, OrderDetails, Orders, Products, Shippers, and Suppliers.`

If you want you can drop them by running  `DROP TABLE [table-name];` (or just keep them).

___

## Exercises:

First create a table called students. It has the columns: 'student_id', 'name', 'major', 'gpa' and 'enrollment_date' We will use a new form of `CREATE TABLE` expression to produce this table.

Note that you can improve this and are welcome to do so -- e.g. by specifying for example a PRIMARY KEY and a FOREIGN KEY in Q2 :)

    CREATE TABLE students AS
        SELECT 1 AS student_id, "John" AS name, "Computer Science" AS major, 3.5 AS gpa, "01-01-2022" AS enrollment_date UNION
        SELECT 2, "Jane", "Physics", 3.8, "01-02-2022" UNION
        SELECT 3, "Bob", "Engineering", 3.0, "01-03-2022" UNION
        SELECT 4, "Samantha", "Physics", 3.9, "01-04-2022" UNION
        SELECT 5, "James", "Engineering", 3.7, "01-05-2022" UNION
        SELECT 6, "Emily", "Computer Science", 3.6, "01-06-2022" UNION
        SELECT 7, "Michael", "Computer Science", 3.2, "01-07-2022" UNION
        SELECT 8, "Jessica", "Engineering", 3.8, "01-08-2022" UNION
        SELECT 9, "Jacob", "Physics", 3.4, "01-09-2022" UNION
        SELECT 10, "Ashley", "Physics", 3.9, "01-10-2022";


## Q1 Simple SELECTS (on the students table)
1. SELECT all records in the table.
2. SELECT students whose major is "Computer Science".
3. SELECT all unique majors (use SELECT DISTINCT) and order them by name, descending order (i.e. Physics first).
4. SELECT all students that have an 'e' in their name and order them by gpa in ascending order.


## Q2 Joins

Create a new table called courses, which indicates the courses taken by the students. 

Create the table by running:
	
    CREATE TABLE courses AS
        SELECT 1 AS course_id, "Python programming" AS course_name, 1 AS student_id, "A" AS grade UNION
        SELECT 2, "Data Structures", 2, "B" UNION
        SELECT 3, "Database Systems", 3, "B" UNION
        SELECT 1, "Python programming", 4, "A" UNION
        SELECT 4, "Quantum Mechanics", 5, "C" UNION
        SELECT 1, "Python programming", 6, "F" UNION
        SELECT 2, "Data Structures", 7, "C" UNION
        SELECT 3, "Database Systems", 8, "A" UNION
        SELECT 4, "Quantum Mechanics", 9, "A" UNION
        SELECT 2, "Data Structures", 10, "F";

1. COUNT the number of unique courses.
2. JOIN the tables students and courses and COUNT the number of students with the major Computer Science taking the course Python programming.
3. JOIN the tables students and courses and select the students who have grades higher than "C", only show their name, major, gpa, course_name and grade.


## Q3 Aggregate functions, numerical logic and grouping

1. Find the average gpa of all students.
2. SELECT the student with the maximum gpa, display only their student_id, major and gpa
3. SELECT the student with the minimum gpa, display only their student_id, major and gpa
4. SELECT the students with a gpa greater than 3.6 in the majors of "Physics" and "Engineering", display only their student_id, major and gpa
5. Group the students by their major and retrieve the average grade of each major.
6. SELECT the top 2 students with the highest GPA in each major and order the results by major in ascending order, then by GPA in descending order

# Your solution

In [1]:
import pandas as pd
import sqlite3

In [2]:
#!ls

In [3]:
# creating a database 'records'
connection = sqlite3.connect('records.db')

In [4]:
# cursor will allow to run sql command on the database file
cursor=connection.cursor()

In [5]:
cursor.execute("DROP TABLE IF EXISTS students;")

In [6]:
sql_command="""CREATE TABLE students AS
    SELECT 1 AS student_id, "John" AS name, "Computer Science" AS major, 3.5 AS gpa, "01-01-2022" AS enrollment_date UNION
    SELECT 2, "Jane", "Physics", 3.8, "01-02-2022" UNION
    SELECT 3, "Bob", "Engineering", 3.0, "01-03-2022" UNION
    SELECT 4, "Samantha", "Physics", 3.9, "01-04-2022" UNION
    SELECT 5, "James", "Engineering", 3.7, "01-05-2022" UNION
    SELECT 6, "Emily", "Computer Science", 3.6, "01-06-2022" UNION
    SELECT 7, "Michael", "Computer Science", 3.2, "01-07-2022" UNION
    SELECT 8, "Jessica", "Engineering", 3.8, "01-08-2022" UNION
    SELECT 9, "Jacob", "Physics", 3.4, "01-09-2022" UNION
    SELECT 10, "Ashley", "Physics", 3.9, "01-10-2022";"""

In [7]:
cursor.execute(sql_command)

## 1. Simple Selects

### a) Selecting all records in the table

In [8]:
# Selecting all records in the table

query1=       ("""SELECT *
                  FROM students;""")

cursor.execute(query1)
pd.read_sql_query(query1,connection)

   student_id      name             major  gpa enrollment_date
0           1      John  Computer Science  3.5      01-01-2022
1           2      Jane           Physics  3.8      01-02-2022
2           3       Bob       Engineering  3.0      01-03-2022
3           4  Samantha           Physics  3.9      01-04-2022
4           5     James       Engineering  3.7      01-05-2022
5           6     Emily  Computer Science  3.6      01-06-2022
6           7   Michael  Computer Science  3.2      01-07-2022
7           8   Jessica       Engineering  3.8      01-08-2022
8           9     Jacob           Physics  3.4      01-09-2022
9          10    Ashley           Physics  3.9      01-10-2022

### b) Selecting all students whose major is Computer Science

In [9]:
# Selecting all students whose major is Computer Science

query2=("""SELECT * 
           FROM students 
           WHERE major = 'Computer Science';""")

In [10]:
cursor.execute(query2)
pd.read_sql_query(query2,connection)

   student_id     name             major  gpa enrollment_date
0           1     John  Computer Science  3.5      01-01-2022
1           6    Emily  Computer Science  3.6      01-06-2022
2           7  Michael  Computer Science  3.2      01-07-2022

### c) Selecting unique majors and ordering them in descending order

In [11]:
# Selecting unique majors and ordering them in descending order

query3=("""SELECT DISTINCT major 
           FROM students 
           ORDER BY major DESC;""")

In [12]:
cursor.execute(query3)
pd.read_sql_query(query3,connection)

              major
0           Physics
1       Engineering
2  Computer Science

### d) Selecting all students that have an 'e' in their names and ordering them based on their gpa in ascending order

In [13]:
# Selecting all students that have an 'e' in their names and ordering them based on their gpa in ascending order

query4= ("""SELECT * 
            FROM students 
            WHERE name LIKE '%e%'
            ORDER BY gpa ASC;""")

cursor.execute(query4)
pd.read_sql_query(query4,connection)

   student_id     name             major  gpa enrollment_date
0           7  Michael  Computer Science  3.2      01-07-2022
1           6    Emily  Computer Science  3.6      01-06-2022
2           5    James       Engineering  3.7      01-05-2022
3           2     Jane           Physics  3.8      01-02-2022
4           8  Jessica       Engineering  3.8      01-08-2022
5          10   Ashley           Physics  3.9      01-10-2022

## 2. Joins

In [14]:
cursor.execute("DROP TABLE IF EXISTS courses;")

In [15]:
sqlcommand2 =("""CREATE TABLE courses AS
    SELECT 1 AS course_id, "Python programming" AS course_name, 1 AS student_id, "A" AS grade UNION
    SELECT 2, "Data Structures", 2, "B" UNION
    SELECT 3, "Database Systems", 3, "B" UNION
    SELECT 1, "Python programming", 4, "A" UNION
    SELECT 4, "Quantum Mechanics", 5, "C" UNION
    SELECT 1, "Python programming", 6, "F" UNION
    SELECT 2, "Data Structures", 7, "C" UNION
    SELECT 3, "Database Systems", 8, "A" UNION
    SELECT 4, "Quantum Mechanics", 9, "A" UNION
    SELECT 2, "Data Structures", 10, "F";""")

In [16]:
cursor.execute(sqlcommand2)
table2=("""SELECT *
           FROM courses;""")

cursor.execute(table2)
pd.read_sql_query(table2,connection)

   course_id         course_name  student_id grade
0          1  Python programming           1     A
1          1  Python programming           4     A
2          1  Python programming           6     F
3          2     Data Structures           2     B
4          2     Data Structures           7     C
5          2     Data Structures          10     F
6          3    Database Systems           3     B
7          3    Database Systems           8     A
8          4   Quantum Mechanics           5     C
9          4   Quantum Mechanics           9     A

### a) Counting the number of unique courses

In [17]:
# Counting the number of unique courses

query5= ("""SELECT COUNT(DISTINCT course_name) AS number_of_courses
            FROM courses;""")

cursor.execute(query5)
pd.read_sql_query(query5,connection)

   number_of_courses
0                  4

### b) Joining the tables students and courses and counting the number of students with the major Computer Science taking the course Python programming.

In [18]:
# Joining the tables students and courses and counting the number of students with the major Computer Science taking 
# the course Python programming.

query6=       ("""SELECT s.major,c.course_name, COUNT(*) AS number_of_students
                  FROM students AS s 
                  INNER JOIN courses AS c 
                  USING (student_id)
                  WHERE s.major='Computer Science' 
                     AND c.course_name='Python programming';""")

cursor.execute(query6)
pd.read_sql_query(query6,connection)

              major         course_name  number_of_students
0  Computer Science  Python programming                   2

### c) Joining the tables students and courses and select the students who have grades higher than "C", only showing their name, major, gpa, course_name and grade.

In [19]:
# Joining the tables students and courses and select the students who have grades higher than "C", only showing their 
# name, major, gpa, course_name and grade. 

query7=       ("""SELECT s.name, s.major, s.gpa, c.course_name, c.grade
                  FROM students AS s
                  INNER JOIN courses AS c
                  USING (student_id)
                  WHERE c.grade < 'C';""")

cursor.execute(query7)
pd.read_sql_query(query7,connection)

       name             major  gpa         course_name grade
0      John  Computer Science  3.5  Python programming     A
1  Samantha           Physics  3.9  Python programming     A
2      Jane           Physics  3.8     Data Structures     B
3       Bob       Engineering  3.0    Database Systems     B
4   Jessica       Engineering  3.8    Database Systems     A
5     Jacob           Physics  3.4   Quantum Mechanics     A

## 3. Aggregate functions, numerical logic and grouping

### a) Finding the average gpa of all students

In [20]:
# Finding the average gpa of all students.

query8 =      ("""SELECT AVG(gpa) AS avg_gpa
                  FROM students;""")

cursor.execute(query8)
pd.read_sql_query(query8,connection)

   avg_gpa
0     3.58

### b) Selecting the student with the maximum gpa, display only their student_id, major and gpa

In [21]:
# Selecting the student with the maximum gpa, display only their student_id, major and gpa

query9=       (""" SELECT student_id, major, MAX(gpa) AS gpa 
                   FROM students;""")

cursor.execute(query9)
pd.read_sql_query(query9,connection)

   student_id    major  gpa
0           4  Physics  3.9

### c) Selecting the student with the minimum gpa, display only their student_id, major and gpa

In [22]:
# Selecting the student with the minimum gpa, display only their student_id, major and gpa 

query10 =     (""" SELECT student_id, major, MIN(gpa) AS gpa
                   FROM students;""")

cursor.execute(query10)
pd.read_sql_query(query10,connection)

   student_id        major  gpa
0           3  Engineering  3.0

### d) Selecting the students with a gpa greater than 3.6 in the majors of "Physics" and "Engineering", displaying only their student_id, major and gpa

In [23]:
# Selecting the students with a gpa greater than 3.6 in the majors of "Physics" and "Engineering", displaying only their 
# student_id, major and gpa

query11=      ("""SELECT student_id, major, gpa
                  FROM students
                  WHERE major IN ('Physics','Engineering')
                      AND gpa >3;""")

cursor.execute(query11)
pd.read_sql_query(query11,connection)

   student_id        major  gpa
0           2      Physics  3.8
1           4      Physics  3.9
2           5  Engineering  3.7
3           8  Engineering  3.8
4           9      Physics  3.4
5          10      Physics  3.9

### e) Grouping the students by their major and retrieving the average grade of each major

In [24]:
# Grouping the students by their major and retrieving the average grade of each major

query12 =     ("""SELECT major, AVG(gpa) AS avg_gpa
                  FROM students
                  GROUP BY major;""")

cursor.execute(query12)
pd.read_sql_query(query12,connection)

              major   avg_gpa
0  Computer Science  3.433333
1       Engineering  3.500000
2           Physics  3.750000

### f)  Selecting the top 2 students with the highest GPA in each major and order the results by major in ascending order, then by GPA in descending order

In [25]:
# Selecting the top 2 students with the highest GPA in each major and order the results by major in ascending order, 
# then by GPA in descending order

query13=  ("""with another_t AS
             (SELECT name,major,gpa,RANK() 
              OVER(PARTITION BY major
              ORDER BY gpa DESC) AS "Rank"
              FROM students)
              SELECT * from another_t
              WHERE Rank<3
              ORDER BY major;""")

cursor.execute(query13)
pd.read_sql_query(query13,connection)

       name             major  gpa  Rank
0     Emily  Computer Science  3.6     1
1      John  Computer Science  3.5     2
2   Jessica       Engineering  3.8     1
3     James       Engineering  3.7     2
4  Samantha           Physics  3.9     1
5    Ashley           Physics  3.9     1

In [26]:
connection.commit()

In [27]:
connection.close()